jackadam1981/ChromeEc/chip/stm32/registers-stm32g0.h
#ifdef CHIP_FAMILY_STM32F4
#define STM32_SYSCFG_BASE           0x40013800
#else
#define STM32_SYSCFG_BASE           0x40010000
#endif

#define STM32_TIM1_BASE             0x40012c00 /* STM32F373 and STM32G0x1 */
#define STM32_TIM2_BASE             0x40000000
#define STM32_TIM3_BASE             0x40000400
#define STM32_TIM4_BASE             0x40000800
#define STM32_TIM5_BASE             0x40000c00 /* STM32F373 */
#define STM32_TIM6_BASE             0x40001000
#define STM32_TIM7_BASE             0x40001400
#if defined(CHIP_FAMILY_STM32L)
#define STM32_TIM9_BASE             0x40010800 /* STM32L15X only */
#define STM32_TIM10_BASE            0x40010C00 /* STM32L15X only */
#define STM32_TIM11_BASE            0x40011000 /* STM32L15X only */
#elif defined(CHIP_FAMILY_STM32F4)
#define STM32_TIM9_BASE             0x40014000 /* STM32F41x only */
#define STM32_TIM10_BASE            0x40014400 /* STM32F41x only */
#define STM32_TIM11_BASE            0x40014800 /* STM32F41x only */
#endif /* TIM9-11 */
#define STM32_TIM12_BASE            0x40001800 /* STM32F373 */
#define STM32_TIM13_BASE            0x40001c00 /* STM32F373 */
#define STM32_TIM14_BASE            0x40002000 /* STM32F373 and STM32G0x1 */
#define STM32_TIM15_BASE            0x40014000
#define STM32_TIM16_BASE            0x40014400
#define STM32_TIM17_BASE            0x40014800
#define STM32_TIM18_BASE            0x40009c00 /* STM32F373 only */
#define STM32_TIM19_BASE            0x40015c00 /* STM32F373 only */

#ifdef CHIP_FAMILY_STM32F4
#define STM32_UNIQUE_ID_BASE        0x1fff7a10
#else
#define STM32_UNIQUE_ID_BASE        0x1ffff7ac
#endif

#if defined(CHIP_FAMILY_STM32F4)
#define STM32_USART1_BASE           0x40011000
#define STM32_USART2_BASE           0x40004400
#define STM32_USART3_BASE           0x40004800
#define STM32_USART4_BASE           0x40004c00
#define STM32_USART5_BASE           0x40005000
#define STM32_USART6_BASE           0x40011400
#else
#define STM32_USART1_BASE           0x40013800
#define STM32_USART2_BASE           0x40004400
#define STM32_USART3_BASE           0x40004800
#define STM32_USART4_BASE           0x40004c00
#define STM32_USART9_BASE           0x40008000 /* LPUART */
#endif

#define STM32_USB_CAN_SRAM_BASE     0x40006000
#define STM32_USB_FS_BASE           0x40005C00

#define STM32_WWDG_BASE             0x40002C00

#else  /* CHIP_FAMILY_STM32H7 */

#define STM32_GPV_BASE              0x51000000

#define STM32_DBGMCU_BASE           0x5C001000

#define STM32_BDMA_BASE             0x58025400
#define STM32_DMA1_BASE             0x40020000
#define STM32_DMA2_BASE             0x40020400
#define STM32_DMA2D_BASE            0x52001000
#define STM32_DMAMUX1_BASE          0x40020800
#define STM32_DMAMUX2_BASE          0x58025800
#define STM32_MDMA_BASE             0x52000000

#define STM32_EXTI_BASE             0x58000000

#define STM32_FLASH_REGS_BASE       0x52002000

#define STM32_GPIOA_BASE            0x58020000
#define STM32_GPIOB_BASE            0x58020400
#define STM32_GPIOC_BASE            0x58020800
#define STM32_GPIOD_BASE            0x58020C00
#define STM32_GPIOE_BASE            0x58021000
#define STM32_GPIOF_BASE            0x58021400
#define STM32_GPIOG_BASE            0x58021800
#define STM32_GPIOH_BASE            0x58021C00
#define STM32_GPIOI_BASE            0x58022000
#define STM32_GPIOJ_BASE            0x58022400
#define STM32_GPIOK_BASE            0x58022800

#define STM32_IWDG_BASE             0x58004800

#define STM32_LPTIM1_BASE           0x40002400
#define STM32_LPTIM2_BASE           0x58002400
#define STM32_LPTIM3_BASE           0x58002800
#define STM32_LPTIM4_BASE           0x58002C00
#define STM32_LPTIM5_BASE           0x58003000

#define STM32_PWR_BASE              0x58024800
#define STM32_RCC_BASE              0x58024400
#define STM32_RNG_BASE              0x48021800
#define STM32_RTC_BASE              0x58004000

#define STM32_SYSCFG_BASE           0x58000400

#define STM32_SPI1_BASE             0x40013000
#define STM32_SPI2_BASE             0x40003800
#define STM32_SPI3_BASE             0x40003c00
#define STM32_SPI4_BASE             0x40013400
#define STM32_SPI5_BASE             0x40015000

#define STM32_TIM1_BASE             0x40010000
#define STM32_TIM2_BASE             0x40000000
#define STM32_TIM3_BASE             0x40000400
#define STM32_TIM4_BASE             0x40000800
#define STM32_TIM5_BASE             0x40000c00
#define STM32_TIM6_BASE             0x40001000
#define STM32_TIM7_BASE             0x40001400
#define STM32_TIM8_BASE             0x40010400
#define STM32_TIM12_BASE            0x40001800
#define STM32_TIM13_BASE            0x40001c00
#define STM32_TIM14_BASE            0x40002000
#define STM32_TIM15_BASE            0x40014000
#define STM32_TIM16_BASE            0x40014400
#define STM32_TIM17_BASE            0x40014800

#define STM32_UNIQUE_ID_BASE        0x1ff1e800

#define STM32_USART1_BASE           0x40011000
#define STM32_USART2_BASE           0x40004400
#define STM32_USART3_BASE           0x40004800
#define STM32_USART4_BASE           0x40004c00
#define STM32_USART5_BASE           0x40005000
#define STM32_USART6_BASE           0x40011400
#define STM32_USART7_BASE           0x40007800
#define STM32_USART8_BASE           0x40007C00

#endif /* CHIP_FAMILY_STM32H7 */

#if defined(CHIP_FAMILY_STM32G0)
#define STM32_UCPD1_BASE            0x4000a000
#define STM32_UCPD2_BASE            0x4000a400
#endif


#ifndef __ASSEMBLER__

/* Register definitions */

/* --- UCPD --- */
#if defined(CHIP_FAMILY_STM32G0)
#define STM32_UCPD_BASE(n)           CONCAT3(STM32_UCPD, n, _BASE)
#define STM32_UCPD_REG(base, offset) REG32((base) + (offset))

#define STM32_UCPD_CFG1(base)      STM32_UCPD_REG(base, 0x00)
#define STM32_UCPD_CFG1_HBTCLKDIV(n)	((n) & 0x3f)
#define STM32_UCPD_CFG1_IFRGAP(n)	(((n) & 0x1f) << 6)
#define STM32_UCPD_CFG1_TRANSWIN(n)	(((n) & 0x1f) << 11)
#define STM32_UCPD_CFG1_PSC_USBPDCLK(n)	(((n) & 7) << 17)

enum ucpd_pscclk {
	PSCCLK_DIV1 = 0,
	PSCCLK_DIV2,
	PSCCLK_DIV4,
	PSCCLK_DIV8,
	PSCCLK_DIV16,
};

#define STM32_UCPD_CFG1_RXORDSETEN(n)	(((n) & 0x1ff) << 20)

