jackadam1981/ChromeEc/chip/stm32/registers-stm32g0.h
enum ucpd_rx_orderset {
	RX_ORDERSET_SOP		= 0x0001,
	RX_ORDERSET_SOPP	= 0x0002,
	RX_ORDERSET_SOPPP	= 0x0004,
	RX_ORDERSET_HARD_RESET	= 0x0008,
	RX_ORDERSET_CABLE_DETECT = 0x0010,
	RX_ORDERSET_SOPP_DEBUG	= 0x0020,
	RX_ORDERSET_SOPPP_DEBUG = 0x0040,
	RX_ORDERSET_SOP_EXT1	= 0x0080,
	RX_ORDERSET_SOP_EXT2	= 0x0100,
};

#define STM32_UCPD_CFG1_TXDMAEN		BIT(29)
#define STM32_UCPD_CFG1_RXDMAEN		BIT(30)
#define STM32_UCPD_CFG1_UCPDEN		BIT(31)

#define STM32_UCPD_CFG2(base)		STM32_UCPD_REG(base, 0x04)
#define STM32_UCPD_CFG2_RXFILTDIS	BIT(0)
#define STM32_UCPD_CFG2_RXFILT2N3	BIT(1)
#define STM32_UCPD_CFG2_FORCECLK	BIT(2)
#define STM32_UCPD_CFG2_WUPEN		BIT(3)

#define STM32_UCPD_CR(base)		STM32_UCPD_REG(base, 0x0c)
#define STM32_UCPD_CR_TXMODE(n)		((n) & 3)

enum ucpd_txmode {
	TXMODE_NORMAL = 0,
	TXMODE_CABLE_RESET,
	TXMODE_BIST_CARRIER2,
};

#define STM32_UCPD_CR_TXSEND		BIT(2)
#define STM32_UCPD_CR_TXHRST		BIT(3)
#define STM32_UCPD_CR_RXMODE		BIT(4)

enum ucpd_rxmode {
	RXMODE_NORMAL = 0,
	RXMODE_BIST_TEST_DATA
};

#define STM32_UCPD_CR_PHYRXEN		BIT(5)
#define STM32_UCPD_CR_PHYCCSEL		BIT(6)

enum ucpd_ccpin {
	CCPIN_CC1 = 0,
	CCPIN_CC2
};

#define STM32_UCPD_CR_ANASUBMODE(n)	(((n) & 3) << 7)

enum ucpd_anasubmode {
	ANASUBMODE_RP_NONE = 0,
	ANASUBMODE_RP_DEFAULT,
	ANASUBMODE_RP_1_5A,
	ANASUBMODE_RP_3_0A
};

#define STM32_UCPD_CR_ANAMODE		BIT(9)

enum ucpd_anamode {
	ANAMODE_SRC = 0,
	ANAMODE_SNK = 1
};

#define STM32_UCPD_CR_CCENABLE(n)	(((n) & 3) << 10)
#define STM32_UCPD_CR_FRSRXEN		BIT(16)
#define STM32_UCPD_CR_FRSTX		BIT(17)
#define STM32_UCPD_CR_RDCH		BIT(18)
#define STM32_UCPD_CR_CC1TCDIS		BIT(20)
#define STM32_UCPD_CR_CC2TCDIS		BIT(21)

enum ucpd_ccenable {
	CCENABLE_NONE = 0,
	CCENABLE_CC1,
	CCENABLE_CC2,
	CCENABLE_CC1CC2,
};

#define STM32_UCPD_IMR(base)		STM32_UCPD_REG(base, 0x10)
#define STM32_UCPD_IMR_TXISIE		BIT(0)
#define STM32_UCPD_IMR_TXMSGDISCIE	BIT(1)
#define STM32_UCPD_IMR_TXMSGSENTIE	BIT(2)
#define STM32_UCPD_IMR_TXMSGABTIE	BIT(3)
#define STM32_UCPD_IMR_HRSTDISCIE	BIT(4)
#define STM32_UCPD_IMR_HRSTSENTIE	BIT(5)
#define STM32_UCPD_IMR_TXUNDIE		BIT(6)
#define STM32_UCPD_IMR_RXNEIE		BIT(8)
#define STM32_UCPD_IMR_RXORDDETIE	BIT(9)
#define STM32_UCPD_IMR_RXHRSTDETIE	BIT(10)
#define STM32_UCPD_IMR_RXOVRIE		BIT(11)
#define STM32_UCPD_IMR_RXMSGENDIE	BIT(12)
#define STM32_UCPD_IMR_TYPECEVT1IE	BIT(14)
#define STM32_UCPD_IMR_TYPECEVT2IE	BIT(15)
#define STM32_UCPD_IMR_FRSEVTIE		BIT(20)

enum ucpd_imr {
	IMR_TXISIE	= STM32_UCPD_IMR_TXISIE,
	IMR_TXMSGDISCIE = STM32_UCPD_IMR_TXMSGDISCIE,
	IMR_TXMSGSENTIE = STM32_UCPD_IMR_TXMSGSENTIE,
	IMR_TXMSGABTIE	= STM32_UCPD_IMR_TXMSGABTIE,
	IMR_HRSTDISCIE	= STM32_UCPD_IMR_HRSTDISCIE,
	IMR_HRSTSENTIE	= STM32_UCPD_IMR_HRSTSENTIE,
	IMR_TXUNDIE	= STM32_UCPD_IMR_TXUNDIE,
	IMR_RXNEIE	= STM32_UCPD_IMR_RXNEIE,
	IMR_RXORDDETIE	= STM32_UCPD_IMR_RXORDDETIE,
	IMR_RXHRSTDETIE	= STM32_UCPD_IMR_RXHRSTDETIE,
	IMR_RXOVRIE	= STM32_UCPD_IMR_RXOVRIE,
	IMR_RXMSGENDIE	= STM32_UCPD_IMR_RXMSGENDIE,
	IMR_TYPECEVT1IE = STM32_UCPD_IMR_TYPECEVT1IE,
	IMR_TYPECEVT2IE = STM32_UCPD_IMR_TYPECEVT2IE,
	IMR_FRSEVTIE	= STM32_UCPD_IMR_FRSEVTIE,
};

#define STM32_UCPD_SR(base)		STM32_UCPD_REG(base, 0x14)
#define STM32_UCPD_SR_TXIS		BIT(0)
#define STM32_UCPD_SR_TXMSGDISC		BIT(1)
#define STM32_UCPD_SR_TXMSGSENT		BIT(2)
#define STM32_UCPD_SR_TXMSGABT		BIT(3)
#define STM32_UCPD_SR_HRSTDISC		BIT(4)
#define STM32_UCPD_SR_HRSTSENT		BIT(5)
#define STM32_UCPD_SR_TXUND		BIT(6)
#define STM32_UCPD_SR_RXNE		BIT(8)
#define STM32_UCPD_SR_RXORDDET		BIT(9)
#define STM32_UCPD_SR_RXHRSTDET		BIT(10)
#define STM32_UCPD_SR_RXOVR		BIT(11)
#define STM32_UCPD_SR_RXMSGEND		BIT(12)
#define STM32_UCPD_SR_RXERR		BIT(13)
#define STM32_UCPD_SR_TYPECEVT1		BIT(14)
#define STM32_UCPD_SR_TYPECEVT2		BIT(15)
#define   UCPD_SR_TYPEC_VSTATE_CC1(v)  (((v) >> 16) & 3)
#define   UCPD_SR_TYPEC_VSTATE_CC2(v)  (((v) >> 18) & 3)
#define STM32_UCPD_SR_FRSEVT		BIT(19)

enum ucpd_sr {
	SR_TXIS		= STM32_UCPD_SR_TXIS,
	SR_TXMSGDISC	= STM32_UCPD_SR_TXMSGDISC,
	SR_TXMSGSENT	= STM32_UCPD_SR_TXMSGSENT,
	SR_TXMSGABT	= STM32_UCPD_SR_TXMSGABT,
	SR_HRSTDISC	= STM32_UCPD_SR_HRSTDISC,
	SR_HRSTSENT	= STM32_UCPD_SR_HRSTSENT,
	SR_TXUND	= STM32_UCPD_SR_TXUND,
	SR_RXNE		= STM32_UCPD_SR_RXNE,
	SR_RXORDDET	= STM32_UCPD_SR_RXORDDET,
	SR_RXHRSTDET	= STM32_UCPD_SR_RXHRSTDET,
	SR_RXOVR	= STM32_UCPD_SR_RXOVR,
	SR_RXMSGEND	= STM32_UCPD_SR_RXMSGEND,
	SR_RXERR	= STM32_UCPD_SR_RXERR,
	SR_TYPECEVT1	= STM32_UCPD_SR_TYPECEVT1,
	SR_TYPECEVT2	= STM32_UCPD_SR_TYPECEVT2,
	SR_FRSEVT	= STM32_UCPD_SR_FRSEVT,
};

#define STM32_UCPD_ICR(base)		STM32_UCPD_REG(base, 0x18)
#define STM32_UCPD_ICR_TXMSGDISCCF	BIT(1)
#define STM32_UCPD_ICR_TXMSGSENTCF	BIT(2)
#define STM32_UCPD_ICR_TXMSGABTCF	BIT(3)
#define STM32_UCPD_ICR_HRSTDISCCF	BIT(4)
#define STM32_UCPD_ICR_HRSTSENTCF	BIT(5)
#define STM32_UCPD_ICR_TXUNDCF		BIT(6)
#define STM32_UCPD_ICR_RXORDDETCF	BIT(9)
#define STM32_UCPD_ICR_RXHRSTDETCF	BIT(10)
#define STM32_UCPD_ICR_RXOVRCF		BIT(11)
#define STM32_UCPD_ICR_RXMSGENDCF	BIT(12)
#define STM32_UCPD_ICR_TYPECEVT1CF	BIT(14)
#define STM32_UCPD_ICR_TYPECEVT2CF	BIT(15)
#define STM32_UCPD_ICR_FRSEVTCF		BIT(20)

enum ucpd_icr {
	ICR_TXMSGDISCCF = STM32_UCPD_ICR_TXMSGDISCCF,
	ICR_TXMSGSENTCF = STM32_UCPD_ICR_TXMSGSENTCF,
	ICR_TXMSGABTCF	= STM32_UCPD_ICR_TXMSGABTCF,
	ICR_HRSTDISCCF	= STM32_UCPD_ICR_HRSTDISCCF,
	ICR_HRSTSENTCF	= STM32_UCPD_ICR_HRSTSENTCF,
	ICR_TXUNDCF	= STM32_UCPD_ICR_TXUNDCF,
	ICR_RXORDDETICF	= STM32_UCPD_ICR_RXORDDETCF,
	ICR_RXHRSTDETCF = STM32_UCPD_ICR_RXHRSTDETCF,
	ICR_RXOVRCF	= STM32_UCPD_ICR_RXOVRCF,
	ICR_RXMSGENDCF	= STM32_UCPD_ICR_RXMSGENDCF,
	ICR_TYPECEVT1CF = STM32_UCPD_ICR_TYPECEVT1CF,
	ICR_TYPECEVT2CF = STM32_UCPD_ICR_TYPECEVT2CF,
	ICR_FRSEVTCF	= STM32_UCPD_ICR_FRSEVTCF,
};

#define STM32_UCPD_TX_ORDSET(base)	STM32_UCPD_REG(base, 0x1c)

#define UCPD_SYNC1 0x18u
#define UCPD_SYNC2 0x11u
#define UCPD_SYNC3 0x06u
#define UCPD_RST1  0x07u
#define UCPD_RST2  0x19u
#define UCPD_EOP   0x0Du

enum ucpd_tx_ordset {
	TX_ORDERSET_SOP =	(UCPD_SYNC1 |
				(UCPD_SYNC1<<5u) |
				(UCPD_SYNC1<<10u) |
				(UCPD_SYNC2<<15u)),
	TX_ORDERSET_SOP1 =	(UCPD_SYNC1 |
				(UCPD_SYNC1<<5u) |
				(UCPD_SYNC3<<10u) |
				(UCPD_SYNC3<<15u)),
	TX_ORDERSET_SOP2 =	(UCPD_SYNC1 |
				(UCPD_SYNC3<<5u) |
				(UCPD_SYNC1<<10u) |
				(UCPD_SYNC3<<15u)),
	TX_ORDERSET_HARD_RESET =	(UCPD_RST1  |
					(UCPD_RST1<<5u) |
					(UCPD_RST1<<10u)  |
					(UCPD_RST2<<15u)),
	TX_ORDERSET_CABLE_RESET =
					(UCPD_RST1 |
					(UCPD_SYNC1<<5u) |
					(UCPD_RST1<<10u)  |
					(UCPD_SYNC3<<15u)),
	TX_ORDERSET_SOP1_DEBUG =	(UCPD_SYNC1 |
					(UCPD_RST2<<5u) |
					(UCPD_RST2<<10u) |
					(UCPD_SYNC3<<15u)),
	TX_ORDERSET_SOP2_DEBUG =	(UCPD_SYNC1 |
					(UCPD_RST2<<5u) |
					(UCPD_SYNC3<<10u) |
					(UCPD_SYNC2<<15u)),
};

#define STM32_UCPD_TX_PAYSZ(base)	STM32_UCPD_REG(base, 0x20)
#define STM32_UCPD_TXPAYSZ(n)		((n) & 0x3ff)

